kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/edu-riscv64/src/k210_w5500.c
/*
* Copyright (c) 2022 AIIT XUOS Lab
* XiUOS is licensed under Mulan PSL v2.
* You can use this software according to the terms and conditions of the Mulan PSL v2.
* You may obtain a copy of Mulan PSL v2 at:
*        http://license.coscl.org.cn/MulanPSL2
* THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
* EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
* MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
* See the Mulan PSL v2 for more details.
*/

/**
* @file k210_w5500.c
* @brief w5500 driver based on simulated SPI
* @version 1.0
* @author AIIT XUOS Lab
* @date 2022-9-14
*/

#include "nuttx/arch.h"
#include "k210_w5500.h"
#include "k210_gpio_common.h"

/****************************************************************************
 * Private Data
 ****************************************************************************/
w5500_param_t w5500_param;

static uint8_t rx_buf[256];
static uint8_t tx_buf[256];

static uint8_t config_ip_addr[] = {10, 0, 30, 50};
static uint8_t config_ip_mask[] = {255, 255, 255, 0};
static uint8_t config_gw_addr[] = {10, 0, 30, 1};
static uint8_t config_mac_addr[] = {0x0C, 0x29, 0xAB, 0x7C, 0x00, 0x01};
static uint8_t config_dst_ip[] = {10, 0, 30, 57};
static uint16_t config_local_port = 5000;
static uint16_t config_dst_port = 6000;
static uint8_t config_mode = SOCK_TCP_CLI;

/****************************************************************************
 * Name: spi_read_byte
 * Description: Read one byte spi data returned
 * input: None
 * output: None
 * return:Read register data
 ****************************************************************************/
static uint8_t spi_read_byte(void)
{
    uint8_t i, dat = 0;
    SCLK_L();

    for(i = 0; i < 8; i++)
    {
        SCLK_H();
        dat <<= 1;
        dat |= k210_gpiohs_get_value(FPIOA_ENET_MISO);
        up_udelay(1);
        SCLK_L();
    }

    return dat;
}

/****************************************************************************
 * Name: spi_write_byte
 * Description: send 1 byte to spi
 * input: data
 * output: None
 * return: None
 ****************************************************************************/
static void spi_write_byte(uint8_t dat)
{
    uint8_t i;

    for(i = 0; i < 8; i++)
    {
        SCLK_L();

        if((dat << i) & 0x80)
        {
            MOSI_H();
        }
        else
        {
            MOSI_L();
        }

        SCLK_H();
    }

    SCLK_L();
}

/****************************************************************************
 * Name: spi_write_short
 * Description: send 2 bytes to spi
 * input: data
 * output: None
 * return: None
 ****************************************************************************/
static void spi_write_short(uint16_t dat)
{
    spi_write_byte((uint8_t)(dat / 256));
    spi_write_byte(dat);
}

/****************************************************************************
 * Name: w5500_write_byte
 *Description: Write 1 byte data to the specified address register through SPI
 *Input: reg: 16 bit register address, dat: data to be written
 * output: None
 * return: None
 ****************************************************************************/
static void w5500_write_byte(uint16_t reg, uint8_t dat)
{
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM1 | RWB_WRITE | COMMON_R);
    spi_write_byte(dat);
    NCS_H();
}

/****************************************************************************
 * Name: w5500_write_short
 * Description: Write 2 bytes data to the specified address register through SPI
 * Input: reg: 16 bit register address, dat: data to be written
 * output: None
 * return: None
 ****************************************************************************/
static void w5500_write_short(uint16_t reg, uint16_t dat)
{
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM2 | RWB_WRITE | COMMON_R);
    spi_write_short(dat);
    NCS_H();
}

/****************************************************************************
 * Name: w5500_write_bytes
 * Description: Write n bytes data to the specified address register through SPI
 * Input: reg: 16 bit register address, dat: data to be written,size:Length of data to be written
 * output: None
 * return: None
 ****************************************************************************/
static void w5500_write_bytes(uint16_t reg, uint8_t *dat, uint16_t size)
{
    uint16_t i;
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(VDM | RWB_WRITE | COMMON_R);

    for(i = 0; i < size; i++)
    {
        spi_write_byte(*dat++);
    }

    NCS_H();
}

/****************************************************************************
 * Name: w5500_write_sock_byte
 * Description: Write 1 byte data to the specified port register through SPI
 * Input: sock: port number, reg: 16 bit register address, dat: data to be written
 * Output: None
 * return: None
 ****************************************************************************/
void w5500_write_sock_byte(socket_t sock, uint16_t reg, uint8_t dat)
{
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM1 | RWB_WRITE | (sock * 0x20 + 0x08));
    spi_write_byte(dat);
    NCS_H();
}

/****************************************************************************
 * Name: w5500_write_sock_short
 * Description: Write 2 bytes data to the specified port register through SPI
 * Input: sock: port number, reg: 16 bit register address, dat: data to be written
 * Output: None
 * return: None
 ****************************************************************************/
void w5500_write_sock_short(socket_t sock, uint16_t reg, uint16_t dat)
{
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM2 | RWB_WRITE | (sock * 0x20 + 0x08));
    spi_write_short(dat);
    NCS_H();
}

/****************************************************************************
 * Name: w5500_write_sock_long
 * Description: Write 4 bytes data to the specified port register through SPI
 * Input: sock: port number, reg: 16 bit register address, dat: 4 byte buffer pointers to be written
 * Output: None
 * return: None
 ****************************************************************************/
void w5500_write_sock_long(socket_t sock, uint16_t reg, uint8_t *dat)
{
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM4 | RWB_WRITE | (sock * 0x20 + 0x08));
    spi_write_byte(*dat++);
    spi_write_byte(*dat++);
    spi_write_byte(*dat++);
    spi_write_byte(*dat++);
    NCS_H();
}

