kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/edu-riscv64/src/k210_w5500.c
/*******************************************************************************
*Function name: w5500_read_byte
*Description: Read 1 byte data of W5500 specified address register
*Input: reg: 16 bit register address
*Output: None
*Return : 1 byte data read from the register
*******************************************************************************/
uint8_t w5500_read_byte(uint16_t reg)
{
    uint8_t val;
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM1 | RWB_READ | COMMON_R);
    val = spi_read_byte();
    NCS_H();
    return val;
}

/*******************************************************************************
*Function name: w5500_read_sock_byte
*Description: Read 1 byte data of W5500 specified port register
*Input: sock: port number, reg: 16 bit register address
*Output: None
*Return: 1 byte data read from the register
*Description: None
*******************************************************************************/
uint8_t w5500_read_sock_byte(socket_t sock, uint16_t reg)
{
    uint8_t val;
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM1 | RWB_READ | (sock * 0x20 + 0x08));
    val = spi_read_byte();
    NCS_H();
    return val;
}

/*******************************************************************************
*Function name: w5500_read_sock_short
*Description: Read 2 bytes of W5500 specified port register
*Input: sock: port number, reg: 16 bit register address
*Output: None
*Return: read 2 bytes of data from the register (16 bits)
*******************************************************************************/
uint16_t w5500_read_sock_short(socket_t sock, uint16_t reg)
{
    uint16_t val;
    NCS_L();
    spi_write_short(reg);
    spi_write_byte(FDM2 | RWB_READ |(sock * 0x20 + 0x08));
    val = spi_read_byte();
    val *= 256;
    val |= spi_read_byte();
    NCS_H();
    return val;
}

/*******************************************************************************
*Function name: w5500_read_sock_bytes
*Description: Read data from W5500 receive data buffer
*Input: sock: port number, * dat: data saving buffer pointer
*Output: None
*Return: read data length
*******************************************************************************/
uint16_t w5500_read_sock_bytes(socket_t sock, uint8_t *dat)
{
    uint16_t recv_size, write_addr;
    uint16_t recv_addr;
    uint16_t i;
    uint8_t val;
    recv_size = w5500_read_sock_short(sock, W5500_SN_RX_RSR_REG);

    /* no receive data */
    if(recv_size == 0)
    {
        return 0;
    }

    if(recv_size > W5500_MAX_PACK_SIZE)
    {
        recv_size = W5500_MAX_PACK_SIZE;
    }

    recv_addr = w5500_read_sock_short(sock, W5500_SN_RX_RD_REG);
    write_addr = recv_addr;

    /* calculate physical address */
    recv_addr &= (SOCK_RECV_SIZE - 1);
    NCS_L();
    spi_write_short(recv_addr);
    spi_write_byte(VDM | RWB_READ | (sock * 0x20 + 0x18));

    if((recv_addr + recv_size) < SOCK_RECV_SIZE)
    {
        for(i = 0; i < recv_size; i++)
        {
            val = spi_read_byte();
            *dat = val;
            dat++;
        }
    }
    else
    {
        recv_addr = SOCK_RECV_SIZE - recv_addr;

        for(i = 0; i < recv_addr; i++)
        {
            val = spi_read_byte();
            *dat = val;
            dat++;
        }

        NCS_H();
        NCS_L();
        spi_write_short(0x00);
        spi_write_byte(VDM | RWB_READ | (sock * 0x20 + 0x18));

        for(; i < recv_size; i++)
        {
            val= spi_read_byte();
            *dat = val;
            dat++;
        }
    }

    NCS_H();
    write_addr += recv_size;

    w5500_write_sock_short(sock, W5500_SN_RX_RD_REG, write_addr);
    /* start receive */
    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_RECV);
    return recv_size;
}

/*******************************************************************************
*Function name: w5500_write_sock_bytes
*Description: Write data to the data sending buffer of W5500
*Input: sock: port number, dat: data storage buffer pointer, size: length of data to be written
*Output: None
*Return: None
*******************************************************************************/
void w5500_write_sock_bytes(socket_t sock, uint8_t *dat, uint16_t size)
{
    uint16_t recv_addr, write_addr;
    uint16_t i;

    /* if udp mode, set ip and port */
    if(w5500_read_sock_byte(sock, W5500_SN_MR_REG) != SOCK_UDP)
    {
        w5500_write_sock_long(sock, W5500_SN_DIPR_REG, w5500_param.udp_ip);
        w5500_write_sock_short(sock, W5500_SN_DPORTR_REG, w5500_param.udp_port);
    }

    recv_addr = w5500_read_sock_short(sock, W5500_SN_TX_WR_REG);
    write_addr = recv_addr;
    recv_addr &= (SOCK_SEND_SIZE - 1);

    NCS_L();
    spi_write_short(recv_addr);
    spi_write_byte(VDM | RWB_WRITE | (sock * 0x20 + 0x10));

    if((recv_addr + size) < SOCK_SEND_SIZE)
    {
        for(i = 0; i < size; i++)
        {
            spi_write_byte(*dat++);
        }
    }
    else
    {
        recv_addr = SOCK_SEND_SIZE - recv_addr;

        for(i = 0; i < recv_addr; i++)
        {
            spi_write_byte(*dat++);
        }

        NCS_H();
        NCS_L();

        spi_write_short(0x00);
        spi_write_byte(VDM | RWB_WRITE | (sock * 0x20 + 0x10));

        for(; i < size; i++)
        {
            spi_write_byte(*dat++);
        }
    }

    NCS_H();
    write_addr += size;

    w5500_write_sock_short(sock, W5500_SN_TX_WR_REG, write_addr);
    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_SEND);
}

/*******************************************************************************
*Function name: w5500_reset
*Description: Hardware reset W5500
*Input: None
*Output: None
*Return value: None
*Note: The reset pin of the W5500 can be encircled only when the low level is at least 500us
*******************************************************************************/
void w5500_reset(void)
{
    uint8_t dat = 0;

    RST_L();
    RST_H();

    /* wait connect ok */
    while((dat & LINK) == 0)
    {
        up_mdelay(500);
        dat = w5500_read_byte(W5500_PHYCFGR_REG);
    }
}

