kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/edu-riscv64/src/k210_w5500.c
/*******************************************************************************
*Function name: w5500_config_init
*Description: Initialize W5500 register functions
*Input: None
*Output: None
*Return value: None
*Note: Before using W5500, initialize W5500
*******************************************************************************/
void w5500_config_init(void)
{
    uint8_t i = 0;

    /* software reset, set 1 and auto clear 0 */
    w5500_write_byte(W5500_MR_REG, MR_RST);
    up_mdelay(100);

    w5500_write_bytes(W5500_GAR_REG, w5500_param.gw_addr, 4);
    w5500_write_bytes(W5500_SUBR_REG, w5500_param.ip_mask, 4);
    w5500_write_bytes(W5500_SHAR_REG, w5500_param.mac_addr, 6);
    w5500_write_bytes(W5500_SIPR_REG, w5500_param.ip_addr, 4);

    /* set socket rx and tx memory size 2k */
    for(i = 0; i < 8; i++)
    {
        w5500_write_sock_byte(i, W5500_SN_RXBUF_SIZE_REG, 0x02);
        w5500_write_sock_byte(i, W5500_SN_TXBUF_SIZE_REG, 0x02);
    }

    /* set retry time 200ms (0x07d0 = 2000) */
    w5500_write_short(W5500_RTR_REG, 0x07d0);

    /* retry time with 8, when exceed it, produce overtime interrupt, set W5500_SN_IR_REG(TIMEOUT) */
    w5500_write_byte(W5500_RCR_REG, 8);
}

/*******************************************************************************
*Function name: Detect_Gateway
*Description: Check the gateway server
*Input: None
*Output: None
*Return value: TRUE (0xFF) for success, FALSE (0x00) for failure
*******************************************************************************/
uint8_t w5500_detect_gateway(void)
{
    uint8_t ip_addr[4] = {w5500_param.ip_addr[0] + 1, w5500_param.ip_addr[1] + 1, w5500_param.ip_addr[2] + 1, w5500_param.ip_addr[3] + 1};

    /* check gateway and get gateway phyiscal address */
    w5500_write_sock_long(0, W5500_SN_DIPR_REG, ip_addr);
    w5500_write_sock_byte(0, W5500_SN_MR_REG, SN_MR_TCP);
    w5500_write_sock_byte(0, W5500_SN_CR_REG, SN_CR_OPEN);
    up_mdelay(5);

    if(w5500_read_sock_byte(0, W5500_SN_SR_REG) != SOCK_INIT)
    {
        w5500_write_sock_byte(0, W5500_SN_CR_REG, SN_CR_CLOSE);
        return FALSE;
    }

    /* set socket connection mode */
    w5500_write_sock_byte(0, W5500_SN_CR_REG, SN_CR_CONNECT);

    do
    {
        uint8_t val = 0;
        /* read socket0 interrupt register */
        val = w5500_read_sock_byte(0, W5500_SN_IR_REG);

        if(val != 0)
        {
            w5500_write_sock_byte(0, W5500_SN_IR_REG, val);
        }

        up_mdelay(5);

        if((val & IR_TIMEOUT) == IR_TIMEOUT)
        {
            return FALSE;
        }
        else if(w5500_read_sock_byte(0, W5500_SN_DHAR_REG) != 0xff)
        {
            /* close socket */
            w5500_write_sock_byte(0, W5500_SN_CR_REG, SN_CR_CLOSE);
            return TRUE;
        }
    } while(1);
    return TRUE;
}

/*******************************************************************************
*Function name: w5500_socket_init
*Description: Specify Socket (0~7) initialization
*Input: sock: port to be initialized
*Output: None
*Return value: None
*******************************************************************************/
void w5500_socket_init(socket_t sock)
{
    /* max partition bytes = 30 */
    w5500_write_sock_short(0, W5500_SN_MSSR_REG, 30);

    switch(sock)
    {
        case 0:
            w5500_write_sock_short(0, W5500_SN_PORT_REG, w5500_param.sock.local_port);
            w5500_write_sock_short(0, W5500_SN_DPORTR_REG, w5500_param.sock.dst_port);
            w5500_write_sock_long(0, W5500_SN_DIPR_REG, w5500_param.sock.dst_ip);
            break;

        default:
            break;
    }
}

/*******************************************************************************
*Function name: w5500_socket_connect
*Description: Set the specified Socket (0~7) as the client to connect with the remote server
*Input: sock: port to be set
*Output: None
*Return value: TRUE (0xFF) for success, FALSE (0x00) for failure
*******************************************************************************/
uint8_t w5500_socket_connect(socket_t sock)
{
    w5500_write_sock_byte(sock, W5500_SN_MR_REG, SN_MR_TCP);
    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_OPEN);
    up_mdelay(5);

    if(w5500_read_sock_byte(sock, W5500_SN_SR_REG) != SOCK_INIT)
    {
        w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_CLOSE);
        return FALSE;
    }

    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_CONNECT);
    return TRUE;
}

/*******************************************************************************
*Function name: w5500_socket_listen
*Description: Set the specified Socket (0~7) as the server to wait for the connection of the remote host
*Input: sock: port to be set
*Output: None
*Return value: TRUE (0xFF) for success, FALSE (0x00) for failure
*******************************************************************************/
uint8_t w5500_socket_listen(socket_t sock)
{
    w5500_write_sock_byte(sock, W5500_SN_MR_REG, SN_MR_TCP);
    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_OPEN);
    up_mdelay(5);

    if(w5500_read_sock_byte(sock, W5500_SN_SR_REG) != SOCK_INIT)
    {
        w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_CLOSE);
        return FALSE;
    }

    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_LISTEN);
    up_mdelay(5);

    if(w5500_read_sock_byte(sock, W5500_SN_SR_REG) != SOCK_LISTEN)
    {
        w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_CLOSE);
        return FALSE;
    }

    return TRUE;
}

/*******************************************************************************
*Function name: w5500_socket_set_udp
*Description: Set the specified Socket (0~7) to UDP mode
*Input: sock: port to be set
*Output: None
*Return value: TRUE (0xFF) for success, FALSE (0x00) for failure
*******************************************************************************/
uint8_t w5500_socket_set_udp(socket_t sock)
{
    w5500_write_sock_byte(sock, W5500_SN_MR_REG, SN_MR_UDP);
    w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_OPEN);
    up_mdelay(5);

    if(w5500_read_sock_byte(sock, W5500_SN_SR_REG) != SOCK_UDP)
    {
        w5500_write_sock_byte(sock, W5500_SN_CR_REG, SN_CR_CLOSE);
        return FALSE;
    }
    return TRUE;
}

