kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/edu-riscv64/src/k210_w5500.c
/*******************************************************************************
*Function name: w5500_irq_process
*Description: W5500 interrupt handler framework
*Input: None
*Output: None
*Return value: None
*Description: None
*******************************************************************************/
void w5500_irq_process(void)
{
    uint8_t ir_flag, sn_flag;
    ir_flag = w5500_read_byte(W5500_SIR_REG);
    do
    {   
        /* handle socket0 event */
        if((ir_flag & S0_INT) == S0_INT)
        {
            sn_flag = w5500_read_sock_byte(0, W5500_SN_IR_REG);
            w5500_write_sock_byte(0, W5500_SN_IR_REG, sn_flag);

            if(sn_flag & IR_CON)
            {
                /* socket connection finished */
                w5500_param.sock.flag |= SOCK_FLAG_CONN;
            }

            if(sn_flag & IR_DISCON)
            {
                /* disconnect state */
                w5500_write_sock_byte(0, W5500_SN_CR_REG, SN_CR_CLOSE);
                w5500_socket_init(0);
                w5500_param.sock.flag = 0;
            }

            if(sn_flag & IR_SEND_OK)
            {
                /* send one package ok */
                w5500_param.sock.state |= SOCK_STAT_SEND;
            }

            if(sn_flag & IR_RECV)
            {
                w5500_param.sock.state |= SOCK_STAT_RECV;
            }

            if(sn_flag & IR_TIMEOUT)
            {
                /* close socket, connection failed */
                w5500_write_sock_byte(0, W5500_SN_CR_REG, SN_CR_CLOSE);
                w5500_param.sock.flag = 0;
            }
        }
        ir_flag = w5500_read_byte(W5500_SIR_REG);
    }while(ir_flag);
}

/*******************************************************************************
*Function name: w5500_intialization
*Description: W5500 initial configuration
*Input: None
*Output: None
*Return value: None
*******************************************************************************/
void w5500_intialization(void)
{
    w5500_config_init();
    w5500_detect_gateway();
    w5500_socket_init(0);
}

/*******************************************************************************
*Function name: w5500_load_param
*Description: load param to  w5500_param
*Input: None
*Output: None
*Return value: None
*******************************************************************************/
void w5500_load_param(void)
{
    w5500_param_t *param = &w5500_param;
    memcpy(param->ip_addr, config_ip_addr, sizeof(config_ip_addr));
    memcpy(param->ip_mask, config_ip_mask, sizeof(config_ip_mask));
    memcpy(param->gw_addr, config_gw_addr, sizeof(config_gw_addr));
    memcpy(param->mac_addr, config_mac_addr, sizeof(config_mac_addr));
    memcpy(param->sock.dst_ip, config_dst_ip, sizeof(config_dst_ip));
    param->sock.local_port = config_local_port;
    param->sock.dst_port = config_dst_port;
    param->sock.mode = config_mode;
}

/*******************************************************************************
*Function name: w5500_socket_config
*Description: W5500 port initialization configuration
*Input: None
*Output: None
*Return value: None
*******************************************************************************/
void w5500_socket_config(void)
{
    if(w5500_param.sock.flag == 0)
    {
        /* TCP Sever */
        if(w5500_param.sock.mode == SOCK_TCP_SVR)
        {
            if(w5500_socket_listen(0) == TRUE)
                w5500_param.sock.flag = SOCK_FLAG_INIT;
            else
                w5500_param.sock.flag = 0;
        }

        /* TCP Client */
        else if(w5500_param.sock.mode == SOCK_TCP_CLI)
        {
            if(w5500_socket_connect(0) == TRUE)
                w5500_param.sock.flag = SOCK_FLAG_INIT;
            else
                w5500_param.sock.flag = 0;
        }

        /* UDP */
        else
        {
            if(w5500_socket_set_udp(0) == TRUE)
                w5500_param.sock.flag = SOCK_FLAG_INIT|SOCK_FLAG_CONN;
            else
                w5500_param.sock.flag = 0;
        }
    }
}

/*******************************************************************************
*Function name: Process_Socket_Data
*Description: W5500 receives and sends the received data
*Input: sock: port number
*Output: None
*Return value: receive data length
*******************************************************************************/
uint16_t Process_Socket_Data(socket_t sock)
{
    uint16_t size;
    size = w5500_read_sock_bytes(sock, rx_buf);
    memcpy(tx_buf, rx_buf, size);
    w5500_write_sock_bytes(sock, tx_buf, size);

    return size;

}

/****************************************************************************
 * Name: SPI_Configuration
 * Description: spi pin mode configure
 * input: None
 * output: None
 * return:none
 ****************************************************************************/
void SPI_Configuration(void)
{
    /* config simluate SPI bus */
    k210_fpioa_config(BSP_ENET_SCLK, HS_GPIO(FPIOA_ENET_SCLK) | K210_IOFLAG_GPIOHS);
    k210_fpioa_config(BSP_ENET_NRST, HS_GPIO(FPIOA_ENET_NRST) | K210_IOFLAG_GPIOHS);
    k210_fpioa_config(BSP_ENET_MOSI, HS_GPIO(FPIOA_ENET_MOSI) | K210_IOFLAG_GPIOHS);
    k210_fpioa_config(BSP_ENET_MISO, HS_GPIO(FPIOA_ENET_MISO) | K210_IOFLAG_GPIOHS);
    k210_fpioa_config(BSP_ENET_NCS,  HS_GPIO(FPIOA_ENET_NCS)  | K210_IOFLAG_GPIOHS);
    k210_fpioa_config(BSP_ENET_NINT, HS_GPIO(FPIOA_ENET_NINT) | K210_IOFLAG_GPIOHS);

    k210_gpiohs_set_direction(FPIOA_ENET_MISO, GPIO_DM_INPUT);
    k210_gpiohs_set_direction(FPIOA_ENET_NRST, GPIO_DM_OUTPUT);
    k210_gpiohs_set_direction(FPIOA_ENET_SCLK, GPIO_DM_OUTPUT);
    k210_gpiohs_set_direction(FPIOA_ENET_MOSI, GPIO_DM_OUTPUT);
    k210_gpiohs_set_direction(FPIOA_ENET_NCS,  GPIO_DM_OUTPUT);
    k210_gpiohs_set_direction(FPIOA_ENET_NINT, GPIO_DM_INPUT);

    k210_gpiohs_set_value(FPIOA_ENET_SCLK, GPIO_PV_HIGH);
    k210_gpiohs_set_value(FPIOA_ENET_MOSI, GPIO_PV_HIGH);
    k210_gpiohs_set_value(FPIOA_ENET_NCS,  GPIO_PV_LOW);
    k210_gpiohs_set_value(FPIOA_ENET_NRST, GPIO_PV_HIGH);
}

void w5500_test(void)
{
    uint8_t cnt = 0;
    uint8_t length = 0;
    SPI_Configuration();
    w5500_load_param();
    w5500_reset();
    w5500_intialization();
    while(1)
    {
        w5500_socket_config();
        w5500_irq_process();

        /* If Socket0 receives data */
        if((w5500_param.sock.state & SOCK_STAT_RECV) == SOCK_STAT_RECV)
        {
            w5500_param.sock.state &= ~SOCK_STAT_RECV;
            length = Process_Socket_Data(0);
            printf("w5500 receive: ");
            for(int i = 0; i < length; i++)
            {
                printf("%x ", rx_buf[i]);
            }
            printf("\n");
        }

        /* Otherwise, send data regularly */
        else if(cnt >= 5)
        {
            if(w5500_param.sock.flag == (SOCK_FLAG_INIT|SOCK_FLAG_CONN))
            {
                w5500_param.sock.state &= ~SOCK_STAT_SEND;
                memcpy(tx_buf, "\r\nWelcome To internet!\r\n", 21);
                w5500_write_sock_bytes(0, tx_buf, 21);
            }
            cnt = 0;
        }
        up_mdelay(100);
        cnt++;
    }

}
